magnus188/trimix-analysator/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y
# Custom partition table with 4MB app + 4MB OTA
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Enable ccache for faster rebuilds
CONFIG_COMPILER_CCACHE=y